---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.#ctor(Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder)
source: html/ee0ee042-7252-3e7c-88e8-e0d12709497c.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.#ctor Method

Constructs a new copy of the input ESFieldBuilder object.

## Syntax (C#)
```csharp
public FieldBuilder(
	FieldBuilder other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null